src/InformationRegisters/IndividualDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>IndividualDocuments</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Series</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Issuer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsIdentityDocument</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Presentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DocumentKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IdentityDocumentKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/IndividualDocuments/Ext/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////
// PROCEDURES - EVENT HANDLERS

Procedure BeforeWrite(Cancellation, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	TextSeries				= NStr("en = ', series: %1'");
	TextNumber				= NStr("en = ', # %1'");
	TextIssueDate			= NStr("en = ', issued: year %1'");
	TexValidityPeriod		= NStr("en = ', valid till: year %1'");
	
	For Each Record In ThisObject Do
		If Record.DocumentKind.IsEmpty() Then
			Record.Presentation = "";
			
		Else
			Record.Presentation = ""
				+ Record.DocumentKind
				+ ?(ValueIsFilled(Record.Series), 			StringFunctionsClientServer.SubstitureParametersInString(TextSeries, Record.Series), "")
				+ ?(ValueIsFilled(Record.Number), 			StringFunctionsClientServer.SubstitureParametersInString(TextNumber, Record.Number), "")
				+ ?(ValueIsFilled(Record.IssueDate), 		StringFunctionsClientServer.SubstitureParametersInString(TextIssueDate, Format(Record.IssueDate,"DF='dd MMMM yyyy'")), "")
				+ ?(ValueIsFilled(Record.ValidityPeriod), 	StringFunctionsClientServer.SubstitureParametersInString(TexValidityPeriod, Format(Record.ValidityPeriod,"DF='dd MMMM yyyy'")), "")
				+ ?(ValueIsFilled(Record.Issuer), ", " + Record.Issuer, "");
			
		EndIf;
	EndDo;
	
EndProcedure

Procedure OnWrite(Cancellation, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	Query = New Query;
	Query.SetParameter("DocumentsTable", Unload(, "Individual, Period, IsIdentityDocument"));
	
	Query.Text =
	"SELECT
	|	DocumentsTable.Individual AS Individual,
	|	DocumentsTable.Period AS Period
	|INTO TT_Documents
	|FROM
	|	&DocumentsTable AS DocumentsTable
	|WHERE
	|	DocumentsTable.IsIdentityDocument
	|
	|INDEX BY
	|	Individual,
	|	Period
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	IndividualDocuments.Individual AS Individual,
	|	IndividualDocuments.Period AS Period,
	|	COUNT(IndividualDocuments.Individual) AS NumberOfDocuments
	|FROM
	|	InformationRegister.IndividualDocuments AS IndividualDocuments
	|		INNER JOIN TT_Documents AS DocumentsSlice
	|		ON IndividualDocuments.Period = DocumentsSlice.Period
	|			AND IndividualDocuments.Individual = DocumentsSlice.Individual
	|			AND (IndividualDocuments.IsIdentityDocument)
	|
	|GROUP BY
	|	IndividualDocuments.Individual,
	|	IndividualDocuments.Period
	|
	|HAVING
	|	COUNT(IndividualDocuments.Individual) > 1";
	Selection = Query.Execute().Choose();
	
	MessageText = NStr("en = 'The %1 ID document for individual %2 already entered.'");
	
	While Selection.Next() Do
		Cancellation = True;
		
		CommonUseClientServer.MessageToUser(StringFunctionsClientServer.SubstitureParametersInString(MessageText, Format(Selection.Period, "DLF=D"), Selection.Individual));
	EndDo;
	
EndProcedure
